{"text": "Tulu is a Dravidian language spoken mainly in the southwestern part of India, particularly in the coastal districts of Karnataka and Kasaragod district of Kerala."}
{"text": "The Tulu script is called Tigalari, which was historically used to write the Tulu language. However, today Tulu is mostly written in Kannada script."}
{"text": "Tulu has a rich oral literature tradition including folk songs, Yakshagana performances, and traditional ballads called Paddanas."}
{"text": "The Tulu-speaking region is known as Tulu Nadu, which roughly corresponds to the undivided Dakshina Kannada district."}
{"text": "Mangalore is the largest city in Tulu Nadu and is considered the cultural hub of Tulu-speaking people."}
{"text": "Tulu cuisine is known for its seafood dishes, including fish curry, prawn ghee roast, and neer dosa."}
{"text": "The Tulu language has several dialects including Common Tulu, Brahmin Tulu, and Jain Tulu."}
{"text": "Tulu has been recognized as a minority language by the Government of Karnataka."}
{"text": "The history of Tulu literature dates back to at least the 14th-15th century with works like Devi Mahatmyam."}
{"text": "Tulu Yakshagana is a traditional theater form that combines dance, music, dialogue, and elaborate costumes."}
{"text": "ತುಳು ಭಾಷೆ ದ್ರಾವಿಡ ಭಾಷಾ ಕುಟುಂಬದ ಭಾಗವಾಗಿದೆ ಮತ್ತು ಕರ್ನಾಟಕದ ಕರಾವಳಿ ಜಿಲ್ಲೆಗಳಲ್ಲಿ ಮಾತನಾಡಲಾಗುತ್ತದೆ."}
{"text": "Tulu is known for its unique phonology and has sounds that are not present in other Dravidian languages."}
{"text": "The Tulu Sahitya Academy was established in 1994 to promote Tulu language and literature."}
{"text": "Tulu has influenced the culture and cuisine of coastal Karnataka and northern Kerala."}
{"text": "Many Tulu speakers are bilingual or multilingual, also speaking Kannada, Konkani, or Malayalam."}
{"text": "The Tulu calendar follows the Saka calendar and begins in the month of Bisu (April)."}
{"text": "Traditional Tulu festivals include Kambala (buffalo race), Bhuta Kola (spirit worship), and Karavali Utsav."}
{"text": "Tulu cinema has a growing industry with several films produced annually in the language."}
{"text": "The Tulu speaking population is estimated to be around 2-3 million people."}
{"text": "Tulu has a Subject-Object-Verb (SOV) word order, typical of Dravidian languages."}
